LtyIntegrationTest/LtyTransaction/target/test-classes/data/json/Request_LTYTransaction_Return_ProcessTranJMSMCOM.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.tibco.com/schemas/MacysLTY_TestBed/SharedResources/Schema/Schema2.xsd" xmlns:v11="http://loyalty.macys.com/schemas/loyalty.transaction/LtyTransactionRequest/v11_0" xmlns:v111="http://loyalty.macys.com/schemas/loyalty.transaction/LtyCommon/v11_0" xmlns:v112="http://loyalty.macys.com/schemas/loyalty.customer/CusCommon/v11_0" xmlns:v113="http://loyalty.macys.com/schemas/loyalty.customer/MacysCommon/v11_0">
   <soapenv:Header/>
   <soapenv:Body>
      <sch:ProcessTranJMS-Req>
         <sch:OperationName>ProcessTran</sch:OperationName>
         <sch:ServiceVersion>v11.2</sch:ServiceVersion>
         <sch:SourceApp>MCOM</sch:SourceApp>
         <sch:AppCorrelationID>1267</sch:AppCorrelationID>
         <sch:ResNum>DynamicReservation</sch:ResNum>
         <sch:RequestTimestamp>DynamicTimeStamp</sch:RequestTimestamp>
         <sch:Division>71</sch:Division>
         <v11:LtyTransactionReq>
            <v111:CommunicationHeader>
               <v111:Division>71</v111:Division>
               <v111:SourceApp>MCOM</v111:SourceApp>
               <v111:SttInfo>
                  <v111:Date>DynamicDate</v111:Date>
                  <v111:Store>129</v111:Store>
                  <v111:RegisterNum>0</v111:RegisterNum>
                  <v111:SalesTransNum>0</v111:SalesTransNum>
               </v111:SttInfo>
               <v111:ReservationNumber>DynamicReservation</v111:ReservationNumber>
               <v111:AssociateId>010001</v111:AssociateId>
               <v111:LTYVersion>11.3</v111:LTYVersion>
            </v111:CommunicationHeader>
            <v112:CustomerIdentifier>
               <v112:AccountType>L</v112:AccountType>
               <v112:AccountNumber>DynamicAccountNumber</v112:AccountNumber>
            </v112:CustomerIdentifier>
            <v11:Header>
               <v113:AddedByApp>MCOM</v113:AddedByApp>
               <v113:Channel>MCOM</v113:Channel>
               <v113:AssociateId>010001</v113:AssociateId>
               <v11:SttInfo>
                  <v113:Date>DynamicDate</v113:Date>
                  <v113:Store>129</v113:Store>
                  <v113:RegisterNum>0</v113:RegisterNum>
                  <v113:SalesTransNum>0</v113:SalesTransNum>
               </v11:SttInfo>
               <v111:FedfilReservationNum>DynamicOrderNum</v111:FedfilReservationNum>
               <v111:OrderNum>DynamicOrderNum</v111:OrderNum>
               <v111:TransactionType>PURCHASE</v111:TransactionType>
               <v113:Division>71</v113:Division>
               <v113:TimeStamp>DynamicTimeStamp</v113:TimeStamp>
               <v11:OfflineRetryFlag>false</v11:OfflineRetryFlag>
            </v11:Header>
            <v11:Tender>
               <v111:Type>DynamicTenderType</v111:Type>
               <v111:ReferenceId>DynamicReferenceId</v111:ReferenceId>
               <v111:Amt>100</v111:Amt>
            </v11:Tender>
            <v11:LineItem>
               <v111:SeqNum>1</v111:SeqNum>
               <v111:OriginalSeqNum>1</v111:OriginalSeqNum>
               <v111:RegistryNum>1</v111:RegistryNum>
               <v111:UPC>86279003997</v111:UPC>
               <v111:Dept>495</v111:Dept>
               <v111:Class>81</v111:Class>
               <v111:ItemOperationType>PURCHASE</v111:ItemOperationType>
               <v111:PriceStatus>10</v111:PriceStatus>
               <v111:PriceSold>50.25</v111:PriceSold>
               <v111:Quantity>1</v111:Quantity>
               <v111:ItemDesc>TABLE</v111:ItemDesc>
               <v111:Division>71</v111:Division>
            </v11:LineItem>
            <v11:LineItem>
               <v111:SeqNum>2</v111:SeqNum>
               <v111:OriginalSeqNum>2</v111:OriginalSeqNum>
               <v111:RegistryNum>1</v111:RegistryNum>
               <v111:UPC>86279003997</v111:UPC>
               <v111:Dept>405</v111:Dept>
               <v111:Class>71</v111:Class>
               <v111:ItemOperationType>PURCHASE</v111:ItemOperationType>
               <v111:PriceStatus>10</v111:PriceStatus>
               <v111:PriceSold>49.75</v111:PriceSold>
               <v111:Quantity>1</v111:Quantity>
               <v111:ItemDesc>TABLE</v111:ItemDesc>
               <v111:Division>71</v111:Division>
            </v11:LineItem>
            <v11:LineItem>
               <v111:SeqNum>3</v111:SeqNum>
               <v111:OriginalSeqNum>3</v111:OriginalSeqNum>
               <v111:RegistryNum>1</v111:RegistryNum>
               <v111:UPC>86279003997</v111:UPC>
               <v111:Dept>445</v111:Dept>
               <v111:Class>61</v111:Class>
               <v111:ItemOperationType>PURCHASE</v111:ItemOperationType>
               <v111:PriceStatus>10</v111:PriceStatus>
               <v111:PriceSold>100</v111:PriceSold>
               <v111:Quantity>1</v111:Quantity>
               <v111:ItemDesc>TABLE</v111:ItemDesc>
               <v111:Division>71</v111:Division>
            </v11:LineItem>
         </v11:LtyTransactionReq>
      </sch:ProcessTranJMS-Req>
   </soapenv:Body>
</soapenv:Envelope>